<a href="https://colab.research.google.com/github/TayBoaes/WoMakersCode-SQL/blob/main/semana_7_SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import sqlite3 #estrutura geral para gente conseguir fazer a conexão

In [ ]:
conexao = sqlite3.connect('banco')
cursor = conexao.cursor()

In [ ]:
cursor.execute (' CREATE TABLE usuarios (id INT, nome VARCHAR (100), endereco VARCHAR (100), email VARCHAR (100))') #dentro das aspas simples vamos começar a criar a nossa tabela

In [ ]:
cursor.execute ('ALTER TABLE usuarios RENAME TO usuario')

In [ ]:
cursor.execute ('ALTER TABLE usuario ADD COLUMN telefoni INT') #criando uma nova coluna

In [ ]:
#anteriomente criamos uma nova coluna na nossa tabela, perceba que a grafia está errada.
cursor.execute ('ALTER TABLE usuario RENAME COLUMN telefoni TO telefone')

In [ ]:
#cursor.execute ('SELECT * FROM usuario' ) #verificando a minha tabela e a mudança feita
print (cursor.fetchall())

[]

In [ ]:
# comando INSERT
cursor.execute('INSERT INTO usuario (id,nome,endereco,email,telefone) VALUES (1,"Isadora","França","taygmail.com",982406678)')

In [ ]:
cursor.execute ('INSERT INTO usuario (id,nome,endereco,telefone) VALUES (1, "Tayná", "Brasil", 25865)')
cursor.execute ('INSERT INTO usuario (id,nome,endereco,telefone) VALUES (2, "Caynã", "Alemanha", 48578)')
cursor.execute ('INSERT INTO usuario (id,nome,endereco,telefone) VALUES (3, "Kauê", "Argentina", 45236)')
cursor.execute ('INSERT INTO usuario (id,nome,endereco,telefone) VALUES (4, "Júlia", "Venezuela", 98565)')
cursor.execute ('INSERT INTO usuario (id,nome,endereco,telefone) VALUES (5, "Pedro", "Coreia", 85236)')

In [ ]:
cursor.execute ('SELECT * FROM usuario' ) #verificando a minha tabela e a mudança feita
print (cursor.fetchall())

[(1, 'Isadora', 'França', 'taygmail.com', 982406678)]

In [ ]:
conexao.commit() #o commit quer dizer que vão ser enviadas as informações
conexao.close #é importante deixar o close para não dar conflito com o nosso gerenciador

In [ ]:
dados = cursor.execute( '''
SELECT * FROM usuario
ORDER BY nome DESC
''')

for usuario in dados:
  print(usuario) #DECRESCENTE

(1, 'Isadora', 'França', 'taygmail.com', 982406678)

In [ ]:
# cláusulas LIMIT E DISTINCT

dados = cursor.execute( '''
SELECT * FROM usuario
LIMIT 1
''')

for usuario in dados:
  print(usuario)
# O LIMIT 1 vai nos retornar apenas uma informação

(1, 'Isadora', 'França', 'taygmail.com', 982406678)

In [ ]:
#O DISTINCT vai trazer somente valores que forem diferentes

dados = cursor.execute( '''
SELECT DISTINCT* FROM usuario
LIMIT 1
''')

for usuario in dados:
  print(usuario)

#Podemos combinar diferentes clásulas para colocar difentes filtros

(1, 'Isadora', 'França', 'taygmail.com', 982406678)

In [ ]:
# Cláusulas: GROUP BY e HAVING

dados = cursor.execute( '''
SELECT nome FROM usuario
GROUP BY  nome
''')

for usuario in dados:
  print(usuario)

('Isadora',)

In [ ]:
#Supondo que queremos somente os usuários de id superior a 3

dados = cursor.execute( '''
SELECT nome FROM usuario
GROUP BY nome
WHERE id = 1
''')

for usuario in dados:
  print(usuario)

  #deu erro porque com o GROUP BY nós vamos conseguir trabalhar com a cláusula WHERE

Warning: You can only execute one statement at a time.

In [ ]:
#Então ao invés de utilizar WHERE, vamos utilizar a clausula HAVING que consegue funcionar com o GROUP BY
dados = cursor.execute ('SELECT nome FROM usuario GROUP BY nome HAVING id =1')

for usuario in dados:
  print(usuario)

# O Having e o Where são similares, a diferença é que a clausula HAVING é utilizado após a agregagação (GROUP BY)
#Já o WHERE é bem aceito antes da agregação

('Isadora',)

 cláusula **JOIN'S** (Right, Left, Full e Inner)


---

É usado quando queremos trabalhar quando queremos retornar informações agrupadas, informações de mais de uma tabela. Temos 4 tipos de joisn: RIGHT, LEFT, FULL e INNER.

In [ ]:
cursor.execute (' CREATE TABLE gerentes (id INT, nome VARCHAR (100), endereco VARCHAR (100), email VARCHAR (100))')

In [ ]:
cursor.execute ('INSERT INTO gerentes (id,nome,endereco,email) VALUES (6, "Ana", "Japão", "ana@gmail.com")')
cursor.execute ('INSERT INTO gerentes (id,nome,endereco,email) VALUES (7, "Rebeca", "Ucrânia", "rebeca@gmail.com")')
cursor.execute ('INSERT INTO gerentes (id,nome,endereco,email) VALUES (8, "Jonas", "Bélgica", "jonas@gmail.com")')
cursor.execute ('INSERT INTO gerentes (id,nome,endereco,email) VALUES (9, "Guilherme", "Holanda", "guilherme@gmail.com")')
cursor.execute ('INSERT INTO gerentes (id,nome,endereco,email) VALUES (10, "Tiago", "Canadá", "tiago@gmail.com")')

In [ ]:
# JOIN - INNER JOIN: vai pegar todas as linhas, todas as informações correspondentes para ambas as tabelas
dados = cursor.execute ('SELECT * FROM usuario INNER JOIN gerentes ON usuario.id = gerentes.id')
for usuario in dados:
  print(usuario)

In [ ]:
#JOIN - LEFT JOIN: são os resultados da tabela esquerda, vai retornar todas as linhas da tabela a esquerda
dados = cursor.execute ('SELECT * FROM usuario LEFT JOIN gerentes ON usuario.nome = gerentes.nome')
for usuario in dados:
  print(usuario)

(1, 'Isadora', 'França', 'taygmail.com', 982406678, None, None, None, None)
(1, 'Tayná', 'Brasil', None, 25865, None, None, None, None)
(2, 'Caynã', 'Alemanha', None, 48578, None, None, None, None)
(3, 'Kauê', 'Argentina', None, 45236, None, None, None, None)
(4, 'Júlia', 'Venezuela', None, 98565, None, None, None, None)
(5, 'Pedro', 'Coreia', None, 85236, None, None, None, None)

In [ ]:
#JOIN - RIGHT JOIN: são os resultados da tabela direita, vai retornar todas as linhas da tabela a direita
dados = cursor.execute ('SELECT * FROM usuario RIGHT JOIN gerentes ON usuario.nome = gerentes.nome')
for usuario in dados:
  print(usuario)

OperationalError: RIGHT and FULL OUTER JOINs are not currently supported

In [ ]:
#JOIN - FULL JOIN: vai retornas todas as linhas da tabela
dados = cursor.execute ('SELECT * FROM usuario FULL JOIN gerentes ON usuario.nome = gerentes.nome')
for usuario in dados:
  print(usuario)

OperationalError: RIGHT and FULL OUTER JOINs are not currently supported

Sub-consultas
- Também conhecidas como subquery sub select, são consultas SQL alinhadas dentro da nossa consulta principal. Elas permitem que a gente consiga estar utilizando o resultado de uma consulta como parte da condição ou de critério de uma outra consulta. São bastante úteis quando queremos realizar operações complexas.

In [ ]:
#Digamos que a gente queira pegar informações de duas tabelas
dados = cursor.execute ('SELECT * FROM usuario WHERE nome IN (SELECT nome FROM gerentes )')
#Estou dizendo: SELECIONE tudo da tabela usuário ONDE nome ESTEJA SELECIONADO nome da tabela gerentes
for usuario in dados:
  print(usuario)

In [ ]:
cursor.execute ('SELECT * FROM usuario')
for gerentes in dados:
  print(gerentes)

(1, 'Isadora', 'França', 'taygmail.com', 982406678)
(1, 'Tayná', 'Brasil', None, 25865)
(2, 'Caynã', 'Alemanha', None, 48578)
(3, 'Kauê', 'Argentina', None, 45236)
(4, 'Júlia', 'Venezuela', None, 98565)
(5, 'Pedro', 'Coreia', None, 85236)

DROP

In [ ]:
cursor.execute ('CREATE TABLE produtos (id INT, nome VARCHAR (100), endereco VARCHAR (100), email VARCHAR (100))')

In [ ]:
#vamos excluir a tabela "produtos" usando DROP
cursor.execute('DROP TABLE produtos') #lembrando que DROP exclui TODA A TABELA

In [ ]:
conexao.commit() #o commit quer dizer que vão ser enviadas as informações
conexao.close #é importante deixar o close para não dar conflito com o nosso gerenciador

CREATE

ALTER
Conseguimos estar utilizando para estar mudando a estrutura da tabela

SELECT

In [ ]:
dados = cursor.execute('SELECT * FROM usuario') #vai me mostrar todas as informações
for usuario in dados: #forma pythonica
  print(usuario)

conexao.commit()
conexao.close

NameError: name 'cursos' is not defined

In [ ]:
#se eu não quiser todas as informações
dados = cursos.execute('SELECT nome * FROM usuario') #eu seleciono apenas a coluna que eu quero ver, exemplo: quero ver apenas o nome
#dados = cursos.execute('SELECT nome, telefone FROM usuario WHERE id > 2') # para mostrar mais de uma coluna. Exemplo: quero ver nome e telefone
for usuario in dados: #forma pythonica
  print(usuario)

conexao.commit()
conexao.close

Revisão SQL: Nara Guimarães - 15/08/2024

Medium: https://medium.com/@nara.guimaraes/tudo-o-que-voc%C3%AA-precisa-saber-sobre-banco-de-dados-45b50bd7e792

Para praticar: https://www.sql-practice.com/

https://www.devmedia.com.br/padronizacao-de-nomenclatura-revista-sql-magazine-100/24710